<template>
	<SelectionManager>
		<div class="page-content article">
			<section lang="ja">
				<p>クリエイターが制作ツールについて語るとき、しばしば「デジタル」と「アナログ」が対比的に取り上げられることがあります。しかし、どのような意味でその二者を区別しているかを厳密に考えている人はそう多くないでしょう。</p>

				<p>多くの場合、その原義である「離散的」「連続的」ではなく、漠然とした感覚として、どれだけツールとの「密着感」があるかを表しているように感じられます。そして「デジタル」は素早く修正が効きやすい反面、体の出入力とアウトプットとがより密に作用しあう感覚、つまり感覚性は「アナログ」には劣るというニュアンスで説明されることもしばしあります。</p>

				<p>僕は数年来、制作ごとにツールから作るということを自分なりに実践してきました。それはしかし、ツールを作るためのUIの部品や、設計思想から再考する必要があるのではないかと考えるようになりました。</p>

				<p>このプロジェクトでは、「デジタル」上のデザインのためのインターフェースが、その利点を活かしつつどのようにすれば「アナログ」のような感覚性を獲得できるかということについて探求します。具体的には、数値ボックスやスライダー・カラーピッカーはどのような挙動をしていると使いやすいか、環境設定画面はどのような構造をとっていると理想的か、といった、とても細かいことです。そして、この中で開発したUIコンポーネントを使って、自分の制作のための、あるいはより汎用的な目的のためのデザインツールを完成させることが最終的な目的です。</p>
			</section>
		</div>
	</SelectionManager>
</template>

<script lang="ts">
import {Component, Vue} from 'vue-property-decorator'

import components from '../components'

@Component({components})
export default class Home extends Vue {}
</script>
